import RentalReduceJs from './client'

export type Rent = {
	title: string
}

const howRent: Array<Rent> = [
	{
		title:
			'Ви вибираєте будь-яке* авто і запитуєте в Carfin потрібну суму для його придбання, але не менше 10% від вартості',
	},
	{
		title:
			'Carfin онлайн перевіряє ваші паспорт та ІПН за відкритими реєстрами та просить заповнити невелику анкету з загальними даними про вас',
	},
	{
		title:
			'Якщо все добре, ми можемо допомогти придбати потрібне вам авто прямо сьогодні. Потім ми зустрічаємося з вами у МРЕВ, де ви сплачуєте перший внесок',
	},
	{
		title:
			'Все, авто ваше! З вашого дзвінка до отримання авто — всього кілька годин',
	},
]

const conditionRent: Array<Rent> = [
	{
		title: 'Ви маєте заробляти від $700на місяць',
	},
	{
		title: 'Авто має коштувати не менше $6000 і не більше $20 000',
	},
	{
		title:
			'Ви маєте зробити перший внесок від 10% вартості авто, якщо ви купуєте його для таксі. Якщо це авто для сімейних потреб, бізнесу тощо, то перший внесок складає від 20%',
	},
	{
		title:
			'Підберемо умови спеціально для вас. Якщо ви знайшли авто дешевше $6000 або дорожче 25 000, ми все одно зможемо запропонувати вам вигідні умови. Тому дзвоніть у будь-якому разі',
	},
]

const faq: Readonly<Array<{ question: string; answer: string }>> = [
	{
		question: 'Який мінімальний та максимальний строк виплати оренди?',
		answer: 'Мінімальний — 12 місяців, максимальний — 36 місяців',
	},
	{
		question: 'Чи можу я достроково викупити авто?',
		answer:
			'Так, після 6 місяців. Втім якщо ви бажаєте закрити договір зараз, ви можете розрахуватися за 6 місяців одразу й не чекати',
	},
	{
		question: 'Чи можу я підібрати авто сам?',
		answer: 'Так, звісно. Ви можете вибрати будь-яке авто до $20 000',
	},
	{
		question: 'Що входить у вартість оренди?',
		answer:
			'Орендний плаітж та частина викупу авто! Будь-яке страхування авто не входить',
	},
]

export type Benefit = {
	title: string
	details: string
	imageSrc: string
}
const benefitns: Array<Benefit> = [
	{
		title: 'На відміну від банку',
		details:
			'Ми не вимагаємо від вас кредитної історії. Ба більше — ви отримаєте авто, навіть якщо у вас є відкриті кредити в банку. Головне, щоб не було відкритих судових проваджень з банками',
		imageSrc:
			'https://www.marketplace.org/wp-content/uploads/2023/04/USdollar.jpg?fit=2800%2C1866',
	},
	{
		title: 'Нам не потрібна',
		details:
			'Ваша офіційна заробітна плата. Тільки ваша можливість щомісячно сплачувати фіксований платіж по договору',
		imageSrc:
			'https://s7d2.scene7.com/is/image/fiserv/fiserv-programmable-payments-blog-hero-1022?ts=1678102412359&dpr=off',
	},
	{
		title: 'Миттєво',
		details:
			'Ухвалюємо рішення, буквально за кілька годин. Тоді як банк може вирішувати ваше питання навіть місяць',
		imageSrc:
			'https://www.topgear.com/sites/default/files/2024/03/1034_DG_LR_Defender2023.jpg',
	},
	{
		title: 'Не вимагаємо',
		details:
			'Повне КАСКО на авто. Тоді як банк оформляє КАСКО на своїх, не дуже вигідних умовах — під 6-7% річних замість 3-4%, що пропонують страхові компанії',
		imageSrc:
			'https://squidex.arsenal-ic.ua/api/assets/a7652cb6-699a-46aa-a8cb-032917b34bfc',
	},
]

export default function RentalPage() {
	return (
		<RentalReduceJs
			howRent={howRent}
			conditionRent={conditionRent}
			benefits={benefitns}
			faq={faq}
		/>
	)
}
